{"Announcements": "\u003ccolor=lightblue\u003eAugust 8th, 2025 - Welcome to our Alpha Demo!\u003c/color\u003e\n\nThis demo is a taste of what is to come, and while we'd love to reveal everything to you already, we did pack in as much as we could without giving away too much either.\n\nMess with and break the game! There's a good lot to discover in this demo. All of us have been pretty addicted to Stabjack, so we hope you enjoy it as much as we do.\n\nAlso, \u003clink=\"Steam\"\u003e\u003ccolor=lightblue\u003e\u003cu\u003eWishlisting\u003c/u\u003e\u003c/color\u003e\u003c/link\u003e us on Steam is very meaningful and helps us a ton!\nFor any feedback and our community, we have a \u003clink=\"Discord\"\u003e\u003ccolor=lightblue\u003e\u003cu\u003eDiscord\u003c/u\u003e\u003c/color\u003e\u003c/link\u003e too, come join in!\n\n- Arthur Yurov, Game Director",
"Changelog": "\u003ccolor=lightblue\u003e<b>November 10th, 2025 - v0.37.26</b>\u003c/color\u003e\n\n<b>Quality of Life</b>\n- Enhanced our Shiny shader for better display of shiny materials\n\n<b>Fixes</b>\n- Some dialogue fixes\n\n\u003ccolor=lightblue\u003e<b>November 5th, 2025 - v0.37.25</b>\u003c/color\u003e\n\n<b>Fixes</b>\n- Fixed Glowing Bottle not preventing Critical Hits properly, and also made that more clear in the description\n\n\u003ccolor=lightblue\u003e<b>October 17th, 2025 - v0.37.24</b>\u003c/color\u003e\n\n<b>Balance</b>\n- Increased Broken Horn's damage increase from 2 to 5 per card\n\n\u003ccolor=lightblue\u003e<b>October 13th, 2025 - v0.37.23</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Removed scaling of Crush/Weaken actions from enemies\n\n<b>Fixes</b>\n- Fixed [REDACTED] image alignments during end of normal run story dialogue\n\n\u003ccolor=lightblue\u003e<b>October 6th, 2025 - v0.37.22</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Added clearer instructions for first draw during the Tutorial\n- Replaced some placeholder music with other placeholder music just for the Alpha\n\n\u003ccolor=lightblue\u003e<b>October 2nd, 2025 - v0.37.21</b>\u003c/color\u003e\n\n<b>Quality of Life</b>\n- Log added to Dialogue sequences\n- \"Clicking to Continue\" notifications replaces \"Continue\" buttons and let you click mostly anywhere\n- \"Skip\" buttons moved to the top right of interfaces\n\n<b>Fixes</b>\n- Updated to latest engine version by Unity's recommendation\n\n\u003ccolor=lightblue\u003e<b>September 24th, 2025 - v0.37.20</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Summoned enemies are not limitless anymore\n- Enemies no longer stack higher Taunt values with higher Nightmare Levels\n- Skip buttons are scarier\n\n\u003ccolor=lightblue\u003e<b>September 22nd, 2025 - v0.37.19</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Changed the outcome of a particular napkin-related event\n- Increased Profile XP gain by about 50%\n\n<b>Fixes</b>\n- Fixed Tooltip appearances happening incorrectly in some cases\n- Fixed issue with seeds not properly affecting some randomized elements the same way every time\n\n\u003ccolor=lightblue\u003e<b>September 16th, 2025 - v0.37.18</b>\u003c/color\u003e\n\n<b>Fixes</b>\n- Fixed freeze that could occur while earning cards in some cases\n- Fixed phantom buff/debuff animations occuring on dead enemies\n\n\u003ccolor=lightblue\u003e<b>September 16th, 2025 - v0.37.17</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Item list adjusted for what can be found in Starter Item Pools\n- Added glow identifier when moving card from sleeve in tutorial\n\n<b>Fixes</b>\n- Fixed Tutorial location names not appearing\n\n\u003ccolor=lightblue\u003e<b>September 15th, 2025 - v0.37.16</b>\u003c/color\u003e\n\n<b>Gameplay</b>\n- Tutorial enhanced with key gameplay additions\n- Increased the difficulty of Nightmare Level Scaling\n- Minor Map Generation changes, increasing Map Generation version. <b>Previous runs will be ended early and XP awards given</b>\n\n<b>Localization</b>\n- First major passes of French, Spanish, and Portuguese language fixes\n- First minor pass of Russian language fixes\n\n<b>Fixes</b>\n- Fixes for interactions with Bloodlust and buffs/debuffs\n- Fixed small issue with Scry Collapse Toggle\n- Fixed issues that could occur when cleansing Burning debuffs\n- Total debuffs cleared are now showed correctly\n\n\u003ccolor=lightblue\u003e<b>September 9th, 2025 - v0.37.15</b>\u003c/color\u003e\n\n<b>Quality of Life</b>\n- Scry UI can be collapsed\n- Curse Event Changes\n- Flags appear next to languages\n\n\u003ccolor=lightblue\u003e<b>September 9th, 2025 - v0.37.14</b>\u003c/color\u003e\n\n<b>Features</b>\n- Initial language implementation of Spanish, Portuguese, Russian, and French\n- Buff/Debuff handling rework and new animations\n\n<b>Balance</b>\n- 8 new Common items and 1 new Rare item added\n- Rebalanced Curse Events\n\n<b>Gameplay</b>\n- Card Modification Events now show all cards in your deck, with ones that already have the modification disabled from being selected\n- Post-Run screen now shows upcoming level rewards\n- Minor sound effect adjustments\n- Renamed \"Crit Increase\" to \"Inspiration\"\n- Renamed \"Crit Decrease\" to \"Precision\"\n\n<b>Fixes</b>\n- Fixed size scaling of enemy summons in some situations\n\n\u003ccolor=lightblue\u003e<b>September 4th, 2025 - v0.37.13</b>\u003c/color\u003e\n\n<b>Balance</b>\n- Handkerchief item changed from Rare to Common and also gives relevant card background +3 value without increasing card total.\n\n<b>Fixes</b>\n- Adjusted Skip Cinematic and Continue buttons during cinematics\n- Added small shadow to Investigate icon during Dialogue investigations\n- Fixed certain events not giving the player information about what happened when Skip Story is enabled\n- Added SMAA Anti-aliasing, fixed text padding, and added Anti-aliasing setting to Quality settings\n\n\u003ccolor=lightblue\u003e<b>September 1st, 2025 - v0.37.12</b>\u003c/color\u003e\n\n<b>Features</b>\n- Reworked animation system, with improvements across the board and new animations\n\n<b>Balance</b>\n- Fake/Sap effects are now handled prior to incoming damage from Burning and Bleeding (when Bleeding takes effect at start of turn instead of end)\n- Changed Gun Holster to be Exotic Grade instead of Rare\n- Added 2 new Rare items\n\n<b>Quality of Life</b>\n- Added clarity to Modify Card events, showing \"Choose up to X cards\" and having the selected amount shown visually on the Confirm button\n- Added text to top right menu buttons\n- Added Play/Skip Story popup selection when starting a new run in place of the Skip Story checkbox\n- Added Skip Story setting to options and Map (automatically enabled/disabled with new run popup)\n- Clarified Merge Cards event dialogue\n- Clarified and added to all dialogue\n- Starting a run from the Tutorial now has its own button instead of the Play Tutorial checkbox\n- Added Skip Cinematic button to most capable cinematics when a profile exists (not first playthrough)\n- Added icon of Jack to current location on the map\n- Repositioned and rescaled enemies to better fit battle backgrounds\n- Added new Casino battle background\n\n<b>Fixes</b>\n- Fixed various Dialogue and text sequences\n- Fixed multiple button click sounds playing when skipping dialogue\n- Fixed continue button not playing sound effect\n- Fixed not being able to click through the Saving Logo if something is behind it\n- Fixed scenarios where animations may not play correctly\n- Fixed First Aid Kit not removing some cases of self-inflicted debuffs on the same turn\n- Fixed an item showing up in the Codex when it wasn't accessible\n\n\u003ccolor=lightblue\u003e<b>August 14th, 2025 - v0.37.11</b>\u003c/color\u003e\n\n- Fixed Royal Crown not properly applying to cards in certain situations\n- Fixed items that added to Card Value without adding to Card Total not applying for Suit-based card modifiers\n- Adjusted some icons for clarity\n- Fixed some dialogue\n\n\u003ccolor=lightblue\u003e<b>August 8th, 2025 - v0.37.10</b>\u003c/color\u003e\n\n- Fixed Sharp cards breaking when dragging them improperly\n- Fixed summoned enemies sometimes spawning with incorrect healh\n\n\u003ccolor=lightblue\u003e<b>August 8th, 2025 - v0.37.9</b>\u003c/color\u003e\n\n- Initial public Alpha release",
"Discord": "https://discord.gg/XaXH3GPyNA",
"Itch": "",
"Steam": "https://store.steampowered.com/app/3913420/Stabjack/?beta=0",
"Kickstarter": "",
"VersionData": "0.37.26"}
